export default class ModalContentProvider {
  constructor() {
    this.modalContents = {
      Arg: {
        title:"ارگ علیشاه" ,
        description: `ارگ علیشاه، که به بقایای ایوان جنوبی مسجد علیشاه در شهر تبریز نیز معروف است، یکی از مهم‌ترین و باارزش‌ترین بناهای تاریخی این شهر به شمار می‌رود. این اثر در دوران ایلخانان، بین سال‌های ۷۱۸ تا ۷۳۹ هجری قمری ساخته شده و به عنوان یکی از آثار ملی ایران به ثبت رسیده است. بنای نخستین ارگ به دوره ایلخانان در اوایل سده هشتم هجری قمری بازمی‌گردد. در ابتدا، هدف اصلی از ساخت این بنا، ایجاد یک مسجد بزرگ و با شکوه بود که بتواند به عنوان مرکز فرهنگی و مذهبی منطقه عمل کند. اما در سال‌های بعد، با استفاده از بقایای این مسجد، ارگ علیشاه به عنوان یک سازه دفاعی و نمادین ساخته شد.
در دوران قاجار، محوطه ارگ تبریز به عنوان بخشی از برج و باروی شهر و همچنین محل انبار مهمات نظامی مورد استفاده قرار گرفت. این سازه ۲۸ متر ارتفاع دارد و با دیوارهای ضخیم و مستحکم خود، نمایانگر قدرت و عظمت معماری آن زمان است. ارگ علیشاه به عنوان یکی از نمادهای تاریخی و فرهنگی تبریز، در طول تاریخ شاهد رویدادهای مهمی بوده و به عنوان یک مکان استراتژیک در دفاع از شهر عمل کرده است.
معماری ارگ علیشاه دارای ویژگی‌های منحصربه‌فرد و زیبایی است. این بنا شامل ایوان جنوبی مسجد علیشاه و بقایای دیوارهای آن است. طراحی این ارگ به گونه‌ای است که با استفاده از مصالح بومی و تکنیک‌های سنتی، هماهنگی خاصی با محیط اطراف خود دارد. همچنین، وجود پله‌های مارپیچ و تزئینات گچبری شده در داخل ارگ، جلوه‌ای خاص به این مکان تاریخی بخشیده است. 
امروزه، ارگ علیشاه به عنوان یکی از جاذبه‌های گردشگری تبریز شناخته می‌شود و توجه بسیاری از گردشگران و محققان را به خود جلب کرده است. بازدید از این بنا، فرصتی برای آشنایی با تاریخ و معماری غنی ایران است و می‌تواند به درک بهتر از فرهنگ و هنر ایرانیان در دوره‌های مختلف تاریخی کمک کند. همچنین، این مکان به عنوان یک مرکز فرهنگی، میزبان رویدادهای هنری و فرهنگی مختلف نیز می‌باشد. ارگ علیشاه نه تنها یک بنای تاریخی، بلکه نمادی از هویت و فرهنگ غنی تبریز و ایران است.
`,
      },
      Blue_Mosque: {
        title: "مسجد کبود",
        description:
          `مسجد کبود، یکی از زیباترین و شاخص‌ترین بناهای تاریخی شهر تبریز است که به دلیل کاشی‌کاری‌های زیبای آبی رنگش به این نام معروف شده است. این مسجد در دوران حکومت قراقویونلوها در قرن نهم هجری ساخته شده و یکی از مهم‌ترین آثار معماری اسلامی در ایران به شمار می‌رود. مسجد کبود در سال ۸۴۵ هجری قمری به دستور سلطان جهانشاه قراقویونلو و به همت دخترش صالحه خانم ساخته شد. طبق کتیبه‌های موجود در سردر مسجد، مدت زمان ساخت این بنا حدود ۳۰ سال بوده است که نشان‌دهنده عظمت و اهمیت آن در آن دوران است. 
در گذشته، این مسجد با نام‌های دیگری همچون مسجد جهانشاه و مسجد سنی نیز شناخته می‌شد. پاسکال کوست، سیاح فرانسوی، در سفرنامه‌اش از آن به عنوان مسجدی یاد کرده که شیعیان تمایلی به استفاده از آن ندارند. مسجد کبود با استفاده از مصالح بومی همچون آجر و سنگ مرمر ساخته شده است. آنچه این بنا را از سایر مساجد متمایز می‌کند، کاشی‌کاری‌های زیبای آبی رنگ آن است که طیف وسیعی از رنگ‌های آبی لاجوردی تا فیروزه‌ای را در بر می‌گیرد. این کاشی‌کاری‌ها در سردر و گنبد مسجد به کار رفته و نمایی خیره‌کننده به آن بخشیده است.
مسجد کبود دارای یک صحن کوچک در قسمت جنوبی و سردابه‌هایی در جنوب صحن است که احتمالاً متعلق به سلطان جهانشاه و دخترش می‌باشد. همچنین، در حیاط مسجد رواق‌هایی در شمال و شرق وجود دارد که بعدها به آن افزوده شده‌اند. امروزه، مسجد کبود به عنوان یکی از جاذبه‌های گردشگری مهم تبریز شناخته می‌شود و بازدید از آن به دلیل معماری زیبا و کاشی‌کاری‌های منحصربه‌فرد، بسیار محبوب است. این بنا نماد هنر و فرهنگ ایرانی در دوران قراقویونلوها به شمار می‌رود.
`,
      },
      Behnam: {
        title: "خانه بهنام",
        description:
          `خانه بهنام، که به عنوان خانه گنجه‌ای نیز شناخته می‌شود، یکی از بناهای تاریخی و ارزشمند شهر تبریز است. این خانه در محله مقصودیه واقع شده و به عنوان یکی از نمونه‌های برجسته معماری قاجاری شناخته می‌شود. قدمت این بنا به اواخر دوره زندیان و اوایل دوره قاجاریان می‌رسد و به دلیل ویژگی‌های خاص خود، مورد توجه گردشگران و محققان قرار دارد. خانه گنجه‌ای در اواخر دوره زندیان ساخته شده و در دوره قاجار نوسازی شده است. این بنا به عنوان محل زندگی یکی از شخصیت‌های مهم آن زمان، یعنی مهدی گنجه‌ای، مورد استفاده قرار می‌گرفت. در طول سال‌ها، این خانه به عنوان یک مکان فرهنگی و تاریخی شناخته شده و بخشی از مدرسه معماری دانشگاه هنر اسلامی تبریز شده است. در بازسازی‌های اخیر، نگارگری‌های ایرانی و نقاشی‌های دیواری ارزشمندی در این بنا کشف شده که نشان‌دهنده هنر و فرهنگ غنی آن دوران است.
معماری خانه گنجه‌ای به سبک قاجاری بوده و دارای ویژگی‌های خاصی است که آن را از سایر بناهای تاریخی متمایز می‌کند. این خانه دارای دو حیاط بیرونی و اندرونی است و شامل دو ساختمان، یکی برای قشلاق و دیگری برای ییلاق می‌باشد. در طراحی داخلی این بنا از پنجره‌های ارسی و شیشه‌های رنگی استفاده شده و ستون‌های بلند و ایوان‌های ستون‌دار به زیبایی آن افزوده است. خانه گنجه‌ای همچنین دارای تزئینات گچبری و نقاشی‌های زیبا است که نشان‌دهنده ذوق و هنر معماران آن زمان می‌باشد. این بنا به عنوان یک نمونه از خانه‌های قدیمی ایرانی، نمایانگر سبک زندگی و فرهنگ مردم تبریز در آن دوران است.
امروزه در این خانه زیبا ساختمان اداری به چشم می‌خورد که تابلو آن حاکی از آن است این خانه متعلق به دانشگاه هنر اسلامی تبریز است و بازسازی این بنا تحت نظر این دانشگاه انجام می‌شود.
`
      },
      El_Goli: {
        title: "ائل گلی",
        description:
        `عمارت ائل‌گلی، یکی از زیباترین و تاریخی‌ترین بناهای شهر تبریز، در دوران آق‌قویونلوها ایجاد شده و در دوره صفویان به شکل کنونی خود درآمده است. این عمارت به عنوان یک باغ بزرگ و زیبا در حاشیه دریاچه‌ای طبیعی طراحی شده و به مرور زمان به یک مرکز تفریحی و گردشگری تبدیل گردیده است. تاریخ ساخت این دریاچه به حدود ۱۷۸۵ میلادی برمی‌گردد و در دوره صفویان، محوطه داخلی آن به‌طور گسترده‌تری گسترش یافت.
        عمارت ائل‌گلی در دوره آق‌قویونلوها به عنوان بزرگ‌ترین منبع ذخیره آب شهر تبریز شناخته می‌شد. در این دوره، آب دریاچه از طریق کانال‌های زیرزمینی به مناطق مختلف شهر هدایت می‌شد. در دوره صفویان نیز توسعه‌های بیشتری بر روی این مجموعه انجام شد و قهرمان میرزا (هشتمین پسر عباس میرزا) آن را تکمیل‌تر نمود و به‌صورت امروزی درآورد.
        این بنا با معماری خاص و تزئینات زیبا، نمایی خیره‌کننده به باغ و دریاچه اطراف خود می‌دهد و به عنوان یک مکان مهم برای برگزاری مراسم و جشن‌ها مورد استفاده قرار گرفته است. در دوره قاجار نیز این مجموعه مورد توجه قرار گرفت و تغییرات و بهبودهایی در آن ایجاد شد.
        در سال ۱۳۷۸ خورشیدی، عمارت ائل‌گلی به عنوان یکی از آثار ملی ایران ثبت شد و امروزه به عنوان نمادی از میراث فرهنگی تبریز شناخته می‌شود. عمارت ائل‌گلی نه تنها یک جاذبه گردشگری است، بلکه نمایانگر هنر و ذوق معماران ایرانی در دوره‌های مختلف تاریخی نیز می‌باشد.
        `,
      },
      Gajar_Muesume: {
        title: "موزه قاجار",
        description:
          `موزه قاجار، که به عنوان خانه امیرنظام گروسی نیز شناخته می‌شود، یکی از مهم‌ترین و زیباترین بناهای تاریخی تبریز است. این موزه به عنوان یادگاری از دوران قاجاریان، در فهرست مکان‌های دیدنی تبریز و آثار ملی ایران قرار دارد. موزه قاجار در واقع بخشی از خانه‌ای است که متعلق به امیرنظام گروسی، یکی از شخصیت‌های برجسته تاریخ ایران، بوده و به عنوان محلی برای نمایش تاریخ، فرهنگ و هنر این دوران شناخته می‌شود. ساختمان موزه قاجار در اواخر دوره قاجار و اوایل قرن بیستم ساخته شده و به عنوان محل زندگی امیرنظام گروسی و خانواده‌اش مورد استفاده قرار می‌گرفته است. این بنا با معماری خاص قاجاری و تزئینات زیبا، به عنوان یکی از نمونه‌های برجسته معماری آن دوران شناخته می‌شود. در سال‌های اخیر، این خانه به موزه تبدیل شده و به نمایش آثار و اشیاء مرتبط با دوران قاجار و زندگی امیرنظام گروسی پرداخته است.
معماری موزه قاجار به سبک قاجاری بوده و شامل ویژگی‌های خاصی است که آن را از سایر بناهای تاریخی متمایز می‌کند. این بنا دارای حیاط مرکزی، اتاق‌های متعدد و تزئینات گچبری و نقاشی‌های زیبا است. همچنین، وجود پنجره‌های مشبک و ارسی در این خانه به زیبایی و جذابیت آن افزوده است. موزه قاجار به عنوان یک موزه تخصصی، محلی برای نمایش اسناد، تصاویر و اشیاء مرتبط با تاریخ قاجار و زندگی اجتماعی آن دوران است. برخی از آثار نگهداری شده در این موزه شامل وسایل قدیمی، سکه‌ها، ابزارهای فلزی و ظروف مختلف است که به بازدیدکنندگان فرصتی می‌دهد تا با تاریخ و فرهنگ غنی ایران آشنا شوند.
امروزه، موزه قاجار به عنوان یکی از جاذبه‌های گردشگری تبریز شناخته می‌شود. این موزه نه تنها نمایانگر تاریخ و فرهنگ ایران در دوران قاجار است، بلکه به عنوان نمادی از تلاش‌های مردم برای حفظ و نگهداری میراث فرهنگی نیز شناخته می‌شود.
`
      },
      Grave_Of_Poets: {
        title: "مقبره الشعرا",
        description:
         `مقبره الشعرا، یکی از مهم‌ترین و زیباترین مکان‌های تاریخی تبریز، به عنوان مدفن بیش از ۴۰۰ شاعر و عارف بزرگ ایرانی شناخته می‌شود. این بنا در قرن ششم هجری و همزمان با آغاز حکومت اتابکان تبریز تأسیس شد. در این دوره، بسیاری از شاعران بزرگ و پرآوازه مانند خاقانی و ظهیر فاریابی به تبریز نقل مکان کردند تا به دور از هیاهو به زندگی و فعالیت‌های ادبی خود ادامه دهند. با مرگ این بزرگان، آن‌ها را در قبرستان محله سرخان دفن کردند و به همین دلیل این گورستان به مقبره الشعرا معروف شد.
این مکان همچنین با نام‌های دیگری همچون حظیره الشعرا و حظیره القضاه نیز شناخته می‌شود. مقبره الشعرا نه تنها مکانی برای دفن شاعران است، بلکه به عنوان یک نماد فرهنگی و ادبی برای شهر تبریز و ایران مطرح می‌باشد. از جمله شاعران مشهور دفن‌شده در این مکان می‌توان به استاد شهریار، خاقانی، اسدی طوسی و لسان شیرازی اشاره کرد. این شاعران در طول تاریخ، نقش مهمی در غنای ادبیات فارسی ایفا کرده‌اند و امروزه به عنوان چهره‌های ماندگار ادبیات ایران شناخته می‌شوند.
معماری مقبره الشعرا نیز به خودی خود جذابیت خاصی دارد. این بنا با طراحی زیبا و فضای سبز اطرافش، به یکی از جاذبه‌های گردشگری تبریز تبدیل شده است. با ورود به این مکان، بازدیدکنندگان می‌توانند از آرامش و زیبایی آن لذت ببرند و با آثار ادبی و فرهنگی ایران آشنا شوند. همچنین، وجود مقبره‌های زیبا و تزئینات گچبری شده در داخل بنا، جلوه‌ای خاص به این مکان بخشیده است.
`
      },
      Kalantar_House: {
        title: "خانه کلانتری",
        description:
          `خانه کلانتری، یکی از بناهای تاریخی و ارزشمند شهر تبریز است که به عنوان نمادی از معماری قاجاری در این شهر شناخته می‌شود. این خانه به عنوان محل زندگی یکی از شخصیت‌های مهم تاریخ ایران، یعنی میرزا ابراهیم خان باغمیشی، ملقب به شرف‌الدوله، ساخته شده است. خانه کلانتری در سال ۱۳۱۱ هجری قمری و در دوران قاجار ساخته شد. این بنا به عنوان محل سکونت میرزا ابراهیم خان شرف‌الدوله کلانتری، یکی از اعضای مجلس شورای اسلامی دوره قاجار، مورد استفاده قرار می‌گرفت. به همین دلیل، این خانه به نام خانه کلانتر شناخته می‌شود. این بنا در طول سال‌ها به عنوان یک مکان فرهنگی و تاریخی شناخته شده و با توجه به اهمیت آن، مورد توجه محققان و گردشگران قرار گرفته است.
معماری خانه کلانتری به سبک قاجاری بوده و شامل ویژگی‌های خاصی است. این بنا دارای حیاط مرکزی، اتاق‌های متعدد و تزئینات گچبری و نقاشی‌های زیبا است. طبقه اول خانه شامل یک طنبی، یک دهلیز و چهار اتاق می‌باشد. از دیگر تزئینات به کار رفته در خانه کلانتر می‌توان به وجود سرستون‌های گچی، طاق رومی بالای ستون‌های ایوان‌های طبقه اول، قالب‌بندی آجری، گچبری‌های برجسته در نما با نگاره‌های انگور و برگ، و کاشیکاری هفت رنگ بالای طاق‌های ایوان‌ها اشاره کرد.
متأسفانه، خانه کلانتر نیز مانند بسیاری از بناهای تاریخی دیگر در تبریز، در طول سال‌ها دچار تخریب و آسیب‌های ناشی از زلزله‌ها و نوسازی‌های غیرمناسب شده است. برخی از بخش‌های این بنا به دلیل عدم نگهداری و توجه کافی، آسیب دیده و از بین رفته‌اند. با این حال، تلاش‌هایی برای مرمت و بازسازی این خانه انجام شده است تا بتواند به عنوان یکی از جاذبه‌های گردشگری تبریز حفظ شود.
`
      },
      KhalatPooshan_Tower: {
        title: "برج خلعت پوشان",
        description:
          `برج خلعت پوشان، یکی از بناهای تاریخی شهر تبریز است که به عنوان نمادی از فرهنگ و تاریخ این شهر شناخته می‌شود. این برج در دوران صفویان ساخته شده و به عنوان محلی برای برگزاری مراسم خلعت‌پوشی مورد استفاده قرار می‌گرفت. مراسمی که در آن افرادی که خدماتی به پادشاه انجام می‌دادند، با خلعت‌هایی مانند عبا، شمشیر یا پول مورد تقدیر قرار می‌گرفتند. برج خلعت پوشان در سال ۸۴۳ هجری قمری به دستور سلطان جهانشاه قراقویونلو ساخته شد. این بنا به عنوان مکانی برای برگزاری مراسم خلعت‌پوشی طراحی شده بود و افراد پس از دریافت خلعت، آن را می‌پوشیدند و به سمت عالی‌قاپو می‌رفتند تا در آنجا به بزرگان ادای احترام کنند و جایگاه خود را در جامعه به نمایش بگذارند. آخرین مراسم خلعت‌پوشی در این برج در سال ۱۳۳۰ هجری قمری برگزار شد.
برج خلعت پوشان دارای ساختاری منحصر به فرد است که به شکل یک منشور بلند طراحی شده است. این برج سه طبقه دارد و سقف طبقه اول به شکل گنبدی و سقف طبقه دوم با استفاده از تیرآهن بازسازی شده است. طبقه سوم به صورت بدون سقف و با دیواره‌های کنگره‌دار طراحی شده که به آن جلوه‌ای خاص می‌بخشد. معماری برج خلعت پوشان نشان‌دهنده هنر و ذوق معماران ایرانی در دوران صفوی است و با استفاده از مصالح بومی و تکنیک‌های سنتی ساخته شده است. این بنا به دلیل طراحی خاص و تاریخی‌اش، امروزه به عنوان یکی از جاذبه‌های گردشگری تبریز شناخته می‌شود. برج خلعت پوشان نه تنها به عنوان یک اثر تاریخی، بلکه به عنوان نمادی از فرهنگ و سنت‌های ایرانی در دوران گذشته نیز شناخته می‌شود
`,
      },
      Khaneh_Mashrouteh: {
        title: "خانه مشروطه",
        description:
          `خانه مشروطه، یکی از خانه‌های تاریخی و موزه‌های مهم شهر تبریز است که در محله راسته‌کوچه واقع شده و به عنوان نمادی از جنبش مشروطه در ایران شناخته می‌شود. این بنا به سبک معماری دوره قاجار ساخته شده و ملک شخصی مهدی کوزه‌کنانی، یکی از شخصیت‌های برجسته و فعال در جنبش مشروطه، بوده است. خانه مشروطه در اواخر قرن نوزدهم میلادی و اوایل قرن بیستم ساخته شد و در آن زمان به عنوان محل برگزاری جلسات و گردهمایی‌های فعالان سیاسی و اجتماعی مورد استفاده قرار می‌گرفت. این خانه به عنوان یکی از مراکز مهم جنبش مشروطه در تبریز شناخته می‌شود و در آنجا تصمیمات مهمی در راستای تحقق اهداف مشروطه اتخاذ شده است. 
در تاریخ ۲۱ مهر ۱۳۵۴، این بنا به شماره ۱۱۷۱ در فهرست آثار ملی ایران ثبت شد و پس از آن به عنوان موزه‌ای برای معرفی تاریخ مشروطه و فعالیت‌های سیاسی آن دوران مورد استفاده قرار گرفت. معماری خانه مشروطه به سبک قاجاری بوده و شامل ویژگی‌های خاصی است که آن را از سایر بناهای تاریخی متمایز می‌کند. این بنا دارای حیاط مرکزی، اتاق‌های متعدد و تزئینات گچبری و نقاشی‌های زیبا است. همچنین، وجود پنجره‌های مشبک و ارسی در این خانه به زیبایی و جذابیت آن افزوده است.
خانه مشروطه به عنوان یک موزه، محلی برای نمایش اسناد، تصاویر و اشیاء مرتبط با جنبش مشروطه و تاریخ سیاسی ایران است. این موزه به بازدیدکنندگان فرصتی می‌دهد تا با تاریخ و فرهنگ غنی ایران آشنا شوند و از نزدیک با وقایع مهم تاریخی آشنا شوند. امروزه، خانه مشروطه به عنوان یکی از جاذبه‌های گردشگری تبریز شناخته می‌شود. این بنا نه تنها نمایانگر تاریخ و فرهنگ ایران در دوران مشروطه است، بلکه به عنوان نمادی از تلاش‌های مردم برای دستیابی به آزادی و حقوق خود نیز شناخته می‌شود.
`
      },
      Meidan_Saat: {
        title: "عمارت شهرداری",
        description:
         `عمارت شهرداری تبریز، که به عنوان موزه شهر نیز شناخته می‌شود، یکی از قدیمی‌ترین و مهم‌ترین بناهای تاریخی این شهر است. این میدان به عنوان نماد تبریز شناخته می‌شود و در مرکز شهر واقع شده است. این بنا در سال ۱۳۱۴ هجری شمسی تبریز ساخته شد و به عنوان یک نقطه مرکزی برای فعالیت‌های اجتماعی و فرهنگی شهر مورد استفاده قرار گرفت. ساخت میدان ساعت به منظور ایجاد یک فضای عمومی برای تجمعات و رویدادهای اجتماعی طراحی شده بود. 
ساخت این بنا به دلیل نیاز به یک مرکز اجتماعی و فرهنگی در تبریز شکل گرفت. در این میدان، برج ساعت به عنوان نماد زمان و پیشرفت در شهر تبریز قرار گرفت و به تدریج به یکی از جاذبه‌های گردشگری تبدیل شد. این برج با طراحی زیبا و خاص خود، به عنوان یکی از نمادهای فرهنگی و تاریخی تبریز شناخته می‌شود. میدان ساعت به دلیل موقعیت مرکزی‌اش، به عنوان یکی از نقاط تردد اصلی در تبریز شناخته می‌شود و به راحتی قابل دسترسی است. این میدان همچنین میزبان بسیاری از رویدادهای فرهنگی و اجتماعی، از جمله جشنواره‌ها و نمایشگاه‌ها بوده و به عنوان محلی برای تجمع مردم در مناسبت‌های مختلف عمل می‌کند.
معماری میدان ساعت به سبک کلاسیک و با استفاده از مصالح بومی طراحی شده است. برج ساعت با ارتفاع قابل توجه و طراحی منحصر به فرد، نمایی زیبا به میدان بخشیده و به عنوان یکی از جاذبه‌های اصلی این مکان شناخته می‌شود. وجود فضای سبز و محوطه‌سازی‌های زیبا در اطراف میدان، به جذابیت آن افزوده است. همچنین، این بنا تحت نظارت مهندسان آلمانی و با طراحی «آودیس اوهانجانیان»، معمار ارمنی، ساخته شده است. 
ساعت این برج از نوع کوکی است و تنها یک نمونه دیگر از آن در دنیا وجود دارد که روی برج معروف بیگ بن لندن قرار دارد. این ساعت به صورت مکانیکی طراحی شده و هر ساعت به تعداد همان ساعت و هر یک ربع نیز سه بار زنگ می‌زند. این ویژگی‌ها باعث شده که ساعت برج به عنوان یک عنصر جذاب و دیدنی در برج ساعت شناخته شود. همچنین، برج ساعت به عنوان یک نماد از زمان و پیشرفت، در طول سال‌ها به عنوان یک نشانه مهم در زندگی روزمره مردم تبریز عمل کرده است. 
`,
      },
      Mgabare_Einali: {
        title: "یادمان شهدای گمنام عون بن علی",
        description:
          `یادمان شهدای گمنام عینالی تبریز، یادمانی است که به یاد هشت تن از شهدای گمنام جنگ ایران و عراق در این منطقه ساخته شده است. این بنا در کنار آرامگاه عون بن علی و زین بن علی واقع شده و به عنوان یک مکان مقدس و فرهنگی برای مردم تبریز شناخته می‌شود. ساخت این یادمان از سال ۱۳۸۱ خورشیدی آغاز شد و در تاریخ ۳۰ شهریور ۱۳۸۵ به بهره‌برداری رسید. هدف از ساخت این بنا، گرامیداشت یاد و خاطره شهدایی بود که در دفاع از میهن اسلامی جان خود را فدای وطن کردند. حرم مطهر شهدای گمنام به عنوان نمادی از فداکاری و ایثارگری جوانان ایرانی در جنگ تحمیلی، محلی برای تجدید میثاق با آرمان‌های شهدا و ترویج فرهنگ ایثار و شهادت در جامعه است.`,
      },
      Rah_Ahan: {
        title: "ایستگاه راه‌آهن",
        description:
          `ساختمان راه‌آهن تبریز یکی دیگر از بناهای تاریخی و معروف این شهر است. ساخت راه‌آهن تبریز در سال ۱۳۰۴ خورشیدی به دستور رضاشاه پهلوی آغاز شد و در سال ۱۳۰۷ به پایان رسید و به عنوان ایستگاه راه‌آهن تبریز مورد استفاده قرار گرفت. این راه‌آهن به عنوان بخشی از خط آهن سراسری تهران-تبریز ساخته شد و نقش مهمی در توسعه اقتصادی و ارتباطی تبریز ایفا کرد. 
در کنار این بنا، یک لوکوموتیو بخار قدیمی قرار دارد که به عنوان یادبودی از دوران اولیه راه‌آهن در ایران به نمایش گذاشته شده است. این لوکوموتیو، یک لوکوموتیو قدیمی است که به عنوان یادبودی از دوران اولیه راه‌آهن در ایران به نمایش گذاشته شده است. این لوکوموتیو متعلق به دوره پهلوی است و نشان‌دهنده پیشرفت‌های صنعتی و فناوری در آن زمان می‌باشد و یک نمونه از لوکوموتیوهای قدیمی است که به عنوان یک اثر تاریخی و فرهنگی حفظ شده است. این لوکوموتیو با طراحی خاص خود و استفاده 
از مصالح مقاوم، نمایی جذاب به ورودی ساختمان راه‌آهن تبریز بخشیده است.
ساختمان ایستگاه راه‌آهن تبریز با معماری خاص خود، به عنوان یکی از نمادهای تاریخی و فرهنگی شهر تبریز شناخته می‌شود. این ساختمان در طول سال‌ها، شاهد ورود و خروج مسافران زیادی بوده و همچنان به عنوان یک ایستگاه فعال مورد استفاده قرار می‌گیرد.
  `
      },
      Yangin: {
        title: "برج یانقین",
        description:
          `برج یانقین، که به عنوان برج آتش‌نشانی تبریز نیز شناخته می‌شود، یکی از بناهای تاریخی و نمادین این شهر است که در اواخر دوره قاجار ساخته شده است و هدف اصلی آن تأمین امنیت و اطفای حریق در شهر بود. با توجه به موقعیت جغرافیایی تبریز و خطرات ناشی از آتش‌سوزی‌ها، این برج به عنوان یک مرکز مهم برای نظارت بر آتش‌سوزی‌ها و ارائه خدمات آتش‌نشانی طراحی شده است. برج یانقین در زمان خود به عنوان یکی از پیشرفته‌ترین و مدرن‌ترین سازه‌های آتش‌نشانی در ایران شناخته می‌شد. برج یانقین به عنوان یک نماد از تلاش‌های شهرداری برای ارتقاء ایمنی و خدمات عمومی در شهر، همواره مورد توجه قرار داشته است.
ارتفاع این بنا  ۲۳ متر است و به عنوان اولین برج آتش نشانی کشور شناخته می‌شود که این برج در قدیم کارکرد دیده‌بانی داشت و نگهبانی در بالای برج کشیک می‌داد تا در صورت وقوع آتش‌سوزی، توسط زنگی آتش‌نشانان را خبر کند. همچنین، در طول سال‌ها، برج یانقین به عنوان محلی برای برگزاری رویدادهای فرهنگی و اجتماعی نیز مورد استفاده قرار گرفته است. معماری برج یانقین به گونه‌ای است که با سبک‌های سنتی و مدرن ترکیب شده و نمایی منحصر به فرد به آن بخشیده است. این بنا دارای تزئینات زیبای آجری و گچبری‌های هنرمندانه است که نشان‌دهنده مهارت‌های بالای معماران آن زمان می‌باشد.
امروزه، برج یانقین به عنوان یکی از نمادهای تاریخی تبریز و جاذبه‌ای برای گردشگران داخلی و خارجی به شمار می‌رود. این بنا نه تنها نمایانگر تاریخ و فرهنگ غنی تبریز است، بلکه به عنوان یادگاری از تلاش‌های شهرداری در راستای تأمین ایمنی و خدمات عمومی در شهر نیز محسوب می‌شود. 
`,
      },
      Sarkis_Church: {
        title: "کلیسای سرکیس مقدس",
        description:
          `کلیسای سرکیس مقدس، یکی از کلیساهای شهر تبریز است که به عنوان یکی از نمادهای مسیحیت در این شهر شناخته می‌شود. این کلیسا در دوران صفویان ساخته شده و به عنوان محلی برای برگزاری مراسم مذهبی مسیحیان ارمنی مورد استفاده قرار می‌گرفت. کلیسای سرکیس مقدس در سال ۱۰۳۰ هجری قمری به دستور شاه عباس صفوی ساخته شد. این بنا به عنوان یکی از مهم‌ترین کلیساهای ارامنه در تبریز شناخته می‌شد و در طول تاریخ، شاهد برگزاری مراسم‌های مذهبی و فرهنگی مسیحیان ارمنی بوده است. 
در دوران قاجار، کلیسای سرکیس مقدس مورد بازسازی قرار گرفت و تغییراتی در آن ایجاد شد. همچنین، در سال ۱۳۵۷ خورشیدی، این کلیسا به عنوان یکی از آثار ملی ایران به ثبت رسید. کلیسای سرکیس مقدس با معماری ارمنی ساخته شده و دارای ویژگی‌های منحصربه‌فرد است. این کلیسا شامل یک صحن و یک گنبد بزرگ است. همچنین، وجود تزئینات گچبری شده و نقاشی‌های دیواری در داخل کلیسا، جلوه‌ای خاص به آن بخشیده است.
یکی از ویژگی‌های منحصربه‌فرد کلیسای سرکیس مقدس، وجود دو برج کلیسایی در ورودی آن است که به آن جلوه‌ای خاص می‌بخشد. این برج‌ها با طراحی زیبا و استفاده از سنگ و آجر ساخته شده‌اند و به عنوان نمادی از معماری ارمنی در تبریز شناخته می‌شوند. این کلیسا نه تنها نمایانگر تاریخ و فرهنگ ارامنه در تبریز است، بلکه به عنوان نمادی از همزیستی مسالمت‌آمیز ادیان در این شهر نیز شناخته می‌شود.
`,
      },
      
    };
  }

  getModalInfo(portalName) {
    return this.modalContents[portalName];
  }
}
